content/teaching/_index.md
+++
title = "Teaching"
draft = false
+++

[MAT215, 2023 Fall]({{< relref "mat215-2023F" >}})


## MAT215, 2023 Spring {#mat215-2023F}


### Course Info {#course-info}

Lecture

-   Instructor: 李立颖 (lily at sustech dot edu dot cn)
-   Time: Tue 14-16, Thu 16-18 (bi-weekly)
-   Location: 第一教学楼 108
-   Office hour: Tue 16-17 or by appointment (Office: M622)

Problem session:

-   TA: 王梓桐 (12331017 at mail dot sustech dot edu dot cn)
-   Time: TBA


### Textbook {#textbook}

-   (Required) Ross, Sheldon M. A First Course in Probability. 10th ed. Upper Saddle River, N.J: Pearson Prentice Hall, 2010. ([Library Link - 9th edition](https://sustc.primo.exlibrisgroup.com.cn/discovery/fulldisplay?docid=alma991000396759704181&context=L&vid=86SUSTC_INST:86SUSTC))
-   Supplementary reading:
    -   Chung, Kai Lai, and Farid AitSahlia. Elementary Probability Theory: With Stochastic Processes and an Introduction to Mathematical Finance. 4th Ed. New York, NY: Springer, 2003. ([Springer Link](https://link.springer.com/book/10.1007/978-0-387-21548-8))
    -   (Chapter 1) Shiryaev, A. N. Probability. Vol. 95. Graduate Texts in Mathematics. New York, NY: Springer New York, 1996. ([Springer Link](https://doi.org/10.1007/978-1-4757-2539-1))
    -   李贤平. 概率论基础. 北京: 高等教育出版社, 2010. ([Library Link](https://sustc.primo.exlibrisgroup.com.cn/discovery/fulldisplay?docid=alma991001345561304181&context=L&vid=86SUSTC_INST:86SUSTC))


### Grades {#grades}

| Components | %   |
|------------|-----|
| Quiz       | 10% |
| HW         | 15% |
| Mid-term   | 25% |
| Final      | 50% |
| Bonus      | 5%  |

-   Quiz: distributed across the semester as a Poisson point process with intensity \\(\sim 1\\) per three weeks
-   HW: See [Homework](#HW)
-   Bonus: bonus problem sets during the semester. See [Bonus Assignments](#bonus)


### Homework {#HW}

There will be weakly homework assignments, which will be due and submitted at the problem session at the following week.


### Bonus Assignments {#bonus}

TBA


### Schedule {#schedule}

Ch1. Introduction (2 hours)
: Introduction; Baby Set Theory; Combinatorial Methods; Binomial Coefficients; Binomial Theorems.

Ch2. Probability Space (4 hours)
: Sample Spaces; Events; The Probability of an Event; Some Rules of Probability; Conditional Probability; Independent Events; Bayes’ Theorem.

Ch3. Discrete &amp; Continuous Random Variables (10 hours)
: Random Variables; Discrete Random Variables; Probability Distributions; Probability Mass Functions; Binomial Random Variable; Poisson Random Variable; Continuous Random Variables; Probability Density Functions; Uniform Distributions; Exponential Distributions; Gamma Distributions; Normal Distributions; Functions of a Random Variable.

Ch4. Random Vectors &amp; Joint Distributions (8 hours)
: Multivariate Random Variables; Joint and Marginal Distribution Functions; Independent Random Variables; Bivariate Normal Distributions; Multivariate Normal Distributions; Transformation of Random Vectors.

Ch5. Mathematical Expectations (10 hours)
: The Expected Value of a Random Variable; The Basic Properties of Expectations; The Variance of a Random Variable; Moments; Covariance and Correlation of Random Vectors.

Ch6. Functions of Random Variables (8 hours)
: Basic Concepts; Property of Expectation of Function of Random Variables; Distribution Function Techniques; Transformation Technique for One Variable; Transformation Technique for Several Variables; Generating Function Technique; Sum and Ratio of Two Random Variables; the Moment Generating Functions: properties and Applications.

Ch7. Limit Theorems (4 hours+2 hours for review)
: Weak Law of Large Number; Central Limit Theorems; Strong Law of Large Number.
